<a href="https://colab.research.google.com/github/minchulkim87/pandas_read_xml/blob/master/pandas_read_xml_example.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [39]:
%%capture
!pip install pandas_read_xml
 
# restart runtime after this install to allow Google colab to use the updated packages.

In [1]:
test_xml = """<?xml version="1.0" encoding="UTF-8"?>
<!-- bookstore.xml -->
<bookstore>
  <book ISBN="0123456001">
    <title>Java For Dummies</title>
    <author>Tan Ah Teck</author>
    <category>Programming</category>
    <year>2009</year>
    <edition>7</edition>
    <price>19.99</price>
  </book>
  <book ISBN="0123456002">
    <title>More Java For Dummies</title>
    <author>Tan Ah Teck</author>
    <category>Programming</category>
    <year>2008</year>
    <price>25.99</price>
  </book>
  <book ISBN="0123456010">
    <title>The Complete Guide to Fishing</title>
    <author>Bill Jones</author>
    <author>James Cook</author>
    <author>Mary Turing</author>
    <category>Fishing</category>
    <category>Leisure</category>
    <language>French</language>
    <year>2000</year>
    <edition>2</edition>
    <price>49.99</price>
  </book>
</bookstore>"""

In [4]:
import pandas_read_xml as pdx
from pandas_read_xml import flatten, fully_flatten, auto_separate_tables

/usr/local/lib/python3.7/dist-packages/requests/__init__.py:91: RequestsDependencyWarning: urllib3 (1.26.4) or chardet (3.0.4) doesn't match a supported version!
  RequestsDependencyWarning)

In [5]:
# See what the reading does
 
df = pdx.read_xml(test_xml, ['bookstore'])
 
df

                                                book
0  {'@ISBN': '0123456001', 'title': 'Java For Dum...
1  {'@ISBN': '0123456002', 'title': 'More Java Fo...
2  {'@ISBN': '0123456010', 'title': 'The Complete...

In [6]:
# See what "flatten" does
 
df = df.pipe(flatten)
 
df

   book|@ISBN                     book|title  ... book|price book|language
0  0123456001               Java For Dummies  ...      19.99           NaN
1  0123456002          More Java For Dummies  ...      25.99           NaN
2  0123456010  The Complete Guide to Fishing  ...      49.99        French

[3 rows x 8 columns]

In [7]:
# There are relational data implied here.
# See what auto_separate_tables can do. Specify what the "primary key" would be.
# Note that this "magic" cannot work on all solutions.
 
key_columns = ['book|@ISBN']
 
data = df.pipe(auto_separate_tables, key_columns)

In [8]:
# The resulting "separated" tables are stored as table_name: dataframe pairs.
 
data.keys()

dict_keys(['author', 'category', 'book'])

In [9]:
data['author']

        @ISBN       author
0  0123456010   Bill Jones
1  0123456010   James Cook
2  0123456010  Mary Turing
3  0123456001  Tan Ah Teck
4  0123456002  Tan Ah Teck

In [10]:
data['category']

        @ISBN     category
0  0123456010      Fishing
1  0123456010      Leisure
2  0123456001  Programming
3  0123456002  Programming

In [11]:
data['book']

        @ISBN                          title  year edition  price language
0  0123456001               Java For Dummies  2009       7  19.99      NaN
1  0123456002          More Java For Dummies  2008     NaN  25.99      NaN
2  0123456010  The Complete Guide to Fishing  2000       2  49.99   French